app/views/devise/registrations/new.html.erb

SELECT "areas".* FROM "areas" ORDER BY "areas"."id" ASC
---
      <%= f.select(:area,"",{promt: "seleccione un área"},{style: :"width:100%",class: :"form-select",id: :area }) do %>
        <%= options_from_collection_for_select(Area.all.order(id: :asc),:id,:nom,0) %>

SELECT "direccions".* FROM "direccions" ORDER BY "direccions"."id" ASC
---
      <%= f.select(:direccion,"",{promt: "seleccione un área"},{style: :"width:100%",class: :"form-select",id: :direccion }) do %>
        <%= options_from_collection_for_select(Direccion.all.order(id: :asc),:id,:nom,0) %>

SELECT "subdireccions".* FROM "subdireccions" ORDER BY "subdireccions"."id" ASC
---
      <%= f.select(:subdireccion,"",{promt: "seleccione una subdireccion"},{style: :"width:100%",class: :"form-select",id: :subdireccion }) do %>
        <%= options_from_collection_for_select(Subdireccion.all.order(id: :asc),:id,:nom,0) %>

SELECT "departamentos".* FROM "departamentos" ORDER BY "departamentos"."id" ASC
---
      <%= f.select(:departamento,"",{promt: "seleccione un departamento"},{style: :"width:100%",class: :"form-select",id: :departamento }) do %>
        <%= options_from_collection_for_select(Departamento.all.order(id: :asc),:id,:nom,0) %>