app/views/partials/_lista_opciones_sol.html.erb

SELECT "relacion_sol_opts".* FROM "relacion_sol_opts" WHERE (opcion_id=47 and solicitud_id=269)
SELECT COUNT(*) FROM "relacion_sol_opts" WHERE (opcion_id=46 and solicitud_id=269)
---
    <% @ids_catalogo.each do |c| %>
    <% @numero_span=RelacionSolOpt.where("opcion_id=? and solicitud_id=?",c.id,@solicitud.id).count %>

SELECT "relacion_sol_opts".* FROM "relacion_sol_opts" WHERE (opcion_id=47 and solicitud_id=269)
---
    </tr>
    <% @relacion=RelacionSolOpt.where("opcion_id=? and solicitud_id=?",c.id,@solicitud.id) %>

SELECT "opcion_avanzadas".* FROM "opcion_avanzadas" WHERE "opcion_avanzadas"."id" = $1 LIMIT $2  [["id", 186], ["LIMIT", 1]]
---
        <tr>
            <td style="padding-right: 2px;"><div class="col-sm-6 .col-md-8"><%= OpcionAvanzada.find(lo.opcion_av_id).nombre %></div></td>