app/views/partials/_navigation.html.erb

SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
---
            <%# link_to "Índice", users_path, class: :"dropdown-item style-no black",style: :"font-size:13px" %>
            <% if !Perfil.find_by(id_usuario:current_user.id).nil? %>
                <% if Perfil.find_by(id_usuario:current_user.id).id_rol == 1 %>
                    <%= link_to "Perfil", perfil_path(Perfil.find_by(id_usuario:current_user.id).id),class: :"dropdown-item style-no black",style: :"font-size:13px"  %>