app/views/solicituds/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 457], ["LIMIT", 1]]
---
                <td><b>Capturó: </b></td>
                <td colspan="<%= @columnas %>"><%= User.find(sol.usuario_captura).nombre_personal.titleize %></td>

SELECT "reportes".* FROM "reportes" WHERE "reportes"."solicitud_id" = $1 LIMIT $2  [["solicitud_id", 269], ["LIMIT", 1]]
SELECT "reportes".* FROM "reportes" WHERE "reportes"."solicitud_id" = $1 LIMIT $2  [["solicitud_id", 268], ["LIMIT", 1]]
---
                    <% if sol.reporte_id_edo == 2 %>
                        <div class="alert alert-primary estado" ><%= link_to sol.reporte_edo , reporte_path(Reporte.find_by(solicitud_id:sol.id).id),class: :"estado style-no ",style: :"color:black" , :title=>sol.reporte_edo_descripcion %></div>
                    <% elsif sol.reporte_id_edo == 4 %>
                        <div class="alert alert-success estado" ><%= link_to sol.reporte_edo , reporte_path(Reporte.find_by(solicitud_id:sol.id).id),class: :"estado style-no ",style: :"color:black" , :title=>sol.reporte_edo_descripcion %></div>

SELECT "reportes".* FROM "reportes" WHERE "reportes"."solicitud_id" = $1 LIMIT $2  [["solicitud_id", 263], ["LIMIT", 1]]
---
                            <% else %>
                                <%= link_to sol.reporte_edo , reporte_path(Reporte.find_by(solicitud_id:sol.id).id),class: :"estado style-no ",style: :"color:black" , :title=>sol.reporte_edo_descripcion %>

SELECT "reportes".* FROM "reportes" WHERE "reportes"."solicitud_id" = $1 LIMIT $2  [["solicitud_id", 266], ["LIMIT", 1]]
---
                        <div class="alert alert-warning estado " role="alert" title="<%= sol.reporte_edo_descripcion %>">
                            <%= link_to  sol.reporte_edo , reporte_path(Reporte.find_by(solicitud_id:sol.id).id),style: :"color:black" %>

SELECT COUNT(*) FROM "relacion_sol_opts" WHERE (solicitud_id=269)
---
                </td>
                <td><b>Acción </b> <% @relacion_cont=RelacionSolOpt.where("solicitud_id=?",sol.id).count %>