app/views/solicituds/index.js.erb

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 269], ["LIMIT", 1]]
---
<% @ids_catalogo=Opcion.all %>
<% @solicitud=Solicitud.find(params[:id]) %>