app/views/perfils/index.html.erb

SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
---
            <td><%= current_user.rol %> </td>
            <td><%= link_to current_user.nombre_personal, perfil_path(Perfil.find_by(id_usuario:current_user.id)),class: :"links-user style-no "  %></td>
            <td><%= link_to raw("#{image_tag("briefcase.svg")} Perfil"), perfil_path(Perfil.find_by(id_usuario:current_user.id)), class: :"btn btn-success btn-sm" %></td>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 449], ["LIMIT", 1]]
SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 449], ["LIMIT", 1]]
---
                <tr>
                    <% @user_p=User.find(p.id_usuario) %>
                    <td><%= @user_p.rol %></td>
                    <td><%= link_to @user_p.nombre_personal ,  perfil_path(Perfil.find_by(id_usuario:@user_p.id))   ,class: :"links-user style-no "  %></td>
                    <td><%= link_to raw("#{image_tag("briefcase.svg")} Perfil"), perfil_path(Perfil.find_by(id_usuario:@user_p.id)), class: :"btn btn-success btn-sm" %></td>