app/views/perfils/show.html.erb

SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
---
    <% end %>
    <%= link_to "Solicitudes creadas y seleccionadas", solicituds_path(id_perfil:Perfil.find_by(id_usuario:@user.id).id), class: :"form-control style-no",style: :"background-color: white;"%>