app/controllers/inventarios_controller.rb

  def index
    @id_Equipo=Tipocomp.find_by("nombre = 'Equipo de Computo'")
    @id_server=Tipocomp.find_by("nombre = 'Servidor'")
    @inventario=Inventario.find_by("tipocomp_id=?",params[:tipocomp_invt])
---
SELECT "tipocomps".* FROM "tipocomps" WHERE (nombre = 'Equipo de Computo') LIMIT $1  [["LIMIT", 1]]
SELECT "tipocomps".* FROM "tipocomps" WHERE (nombre = 'Servidor') LIMIT $1  [["LIMIT", 1]]
SELECT "inventarios".* FROM "inventarios" WHERE (tipocomp_id=NULL) LIMIT $1  [["LIMIT", 1]]