app/controllers/perfils_controller.rb

SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
---
  def index
    @perfil=Perfil.find_by(id_usuario:current_user.id)

SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
SELECT "equipos".* FROM "equipos" WHERE "equipos"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @perfil=Perfil.find_by(id_usuario: current_user.id)
    @equipo=Equipo.find_by(user_id:current_user.id)
    @user=User.find(@perfil.id_usuario)

SELECT "perfils".* FROM "perfils" WHERE "perfils"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def cargar_tabla
    logger.debug "**********************"
    @data=Array.new
    @perfil=Perfil.find(params[:id_p])
    @user=User.find(@perfil.id_usuario)