app/controllers/solicituds_controller.rb

  def index
    logger.debug "******************"+params[:exist].to_s
    if params[:exist].nil?
      @exist=true
    else
      @exist=false
    end

    if !params[:user_id].nil?
      @perfil=Perfil.find_by("id_usuario=?",current_user.id)
      @lista=Solicitud.paginate(page:params[:page]).where("solicitante_id=?",params[:user_id])
    elsif !params[:solicitante].nil?
      @perfil=Perfil.find_by("id_usuario=?",current_user.id)
      @lista=Solicitud.paginate(page:params[:page]).where("nombre_user ilike ('%#{params[:solicitante]}%')")
    else
      if params[:id_perfil].nil?
        @lista=Solicitud.paginate(page:params[:page]).all.order('id DESC')
        @general=true
      else
        @general=false
        if current_user.rol_id==1
          @perfil=Perfil.find(params[:id_perfil])
          @lista=Solicitud.paginate(page:params[:page]).where("perfil_id=? or tecnico_id=?",@perfil.id,@perfil.id_usuario).order("id desc")
---
SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
SELECT "solicituds".* FROM "solicituds" ORDER BY id DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "solicituds"
SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 269], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]