app/models/solicitud.rb

SELECT "estados".* FROM "estados" WHERE "estados"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def estado
    Estado.find(self.estado_id).estado

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 457], ["LIMIT", 1]]
---
  def tecnico
    if self.tecnico_id.nil?
      @@tecnico="No hay tecnico asignado"
    else
      @user=User.find(self.tecnico_id)

SELECT "reportes".* FROM "reportes" WHERE (solicitud_id=269) LIMIT $1  [["LIMIT", 1]]
---
  def reporte_id_edo
    @reporte=Reporte.find_by("solicitud_id=?",self.id)

SELECT "reportes".* FROM "reportes" WHERE (solicitud_id=269) LIMIT $1  [["LIMIT", 1]]
SELECT "estados".* FROM "estados" WHERE "estados"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "estados".* FROM "estados" WHERE "estados"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def  reporte_edo
      @reporte=Reporte.find_by("solicitud_id=?",self.id)
      if @reporte.nil?
        Estado.find(11).estado
      else
        Estado.find(@reporte.estado_id).estado

SELECT "estados".* FROM "estados" WHERE "estados"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def sol_edo_descripcion
    @sol_edo=Estado.find(self.estado_id).descripcion

SELECT "reportes".* FROM "reportes" WHERE (solicitud_id=269) LIMIT $1  [["LIMIT", 1]]
SELECT "estados".* FROM "estados" WHERE "estados"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "estados".* FROM "estados" WHERE "estados"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def  reporte_edo_descripcion
    @reporte=Reporte.find_by("solicitud_id=?",self.id)
    if @reporte.nil?
      Estado.find(11).descripcion
    else
      Estado.find(@reporte.estado_id).descripcion