app/models/user.rb

SELECT "users".* FROM "users" WHERE (lower(username) = 'zeunix' OR lower(email) = 'zeunix') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def self.find_for_database_authentication(warden_conditions)
    conditions = warden_conditions.dup
    if login = conditions.delete(:login)
      where(conditions.to_h).where(["lower(username) = :value OR lower(email) = :value",{:value => login.downcase}]).first

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def nombre_personal
    @user=User.find(self.id)

SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
---
  def perfil_id
    @@perfil=Perfil.find_by(id_usuario:self.id).id

SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
SELECT "rols".* FROM "rols" WHERE "rols"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def rol
    @perfil=Perfil.find_by(id_usuario:self.id)
    if !@perfil.nil?
      @@rol=Perfil.find_by(id_usuario:self.id).id_rol
      Rol.find(@@rol).nombre

SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
---
  def rol_id
    @@rol=Perfil.find_by(id_usuario:self.id).id_rol

SELECT "perfils".* FROM "perfils" WHERE "perfils"."id_usuario" = $1 LIMIT $2  [["id_usuario", 1], ["LIMIT", 1]]
SELECT "rols".* FROM "rols" WHERE "rols"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "relacion_per_rols"."permiso_id" FROM "relacion_per_rols" WHERE "relacion_per_rols"."rol_id" = $1  [["rol_id", 1]]
---
  def permisos
    @@rol=Perfil.find_by(id_usuario:self.id).id_rol
    @id_rol=Rol.find(@@rol).id
    @permisos=RelacionPerRol.where(rol_id:@id_rol).select(:permiso_id)

    @lista_permisos=Array(nil)
    @permisos.each do |pp|